OdDAI.NamedType.appendWhereRule(OdDAI.WhereRule*)
\details
Append Where Rule to the Named Type.
\param ruleDef [in] Smart pointer to rule definition.

OdDAI.NamedType.whereRules
\details
Retrieves a Where Rules list associated with the Named Type.
\returns Returns a list of pointers to associated Where Rules.

OdDAI.NamedType.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.NamedType.type(OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets a type code for named type.

OdDAI.NamedType.type
\details
Retreives a type code of named type.
\returns Returns a smart pointer to type code of named type.

OdDAI.NamedType.originalName
\details
Retrieves the original name of the entity definition.
\returns Returns an ANSI string that contains the original name of the entity definition.

OdDAI.NamedType.name
\details
Retrieves the name of the entity definition.
\returns Returns an ANSI string that contains the name of the entity definition.

OdDAI.NamedType.parentSchema
\details
Retrieves the owner schema of the entity definition.
\returns Returns a pointer to the owner schema of the entity definition.

OdDAI.NamedType.#ctor(OdDAI.Schema*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new named type object with specified parameters.
\param parentSchema [in] A pointer to a schema in which defined type is declared.
\param name [in] A name of defined type.

OdDAI.NamedType
\details
A class that implements the storing of named types.